modeling/openfoam/hx_cell/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 200000;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    tegFace
    {
        type            calculated;
        value           $internalField;
    }

    topWall
    {
        type            calculated;
        value           $internalField;
    }

    fluid_to_leftFin
    {
        type            calculated;
        value           $internalField;
    }

    fluid_to_rightFin
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
