modeling/openfoam/hx_cell/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Gravity: flow is top-to-bottom (gravity-assisted per HX spec)
// Z is the flow direction (downward), so gravity is in +Z

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 9.81);

// ************************************************************************* //
