modeling/openfoam/hx_cell/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Single TEG HX cell: 9 channels + 10 fins
//
// Geometry (all dimensions in meters):
//   Channel width:  0.003 m (3 mm)
//   Fin thickness:  0.001 m (1 mm)
//   Channel height: 0.040 m (40 mm, matches TEG)
//   Flow length:    0.040 m (40 mm)
//   Border walls:   0.0015 m (1.5 mm) each side
//
// Total cell width: 0.0015 + 9*0.003 + 10*0.001 + 0.0015 = 0.040 m
//
// Coordinate system:
//   X = width (across fins)
//   Y = height (channel height / TEG height)
//   Z = flow direction (inlet to outlet)
//
// We model a simplified geometry: a single rectangular channel
// representing the average of all 9 channels, with copper walls.
// For full multi-channel fidelity, use snappyHexMesh with CAD import.
//
// This blockMesh creates a single representative channel with fin walls.

scale 0.001;  // dimensions in mm, converted to meters

vertices
(
    // Channel fluid region (single representative channel)
    // Bottom-left-front to top-right-back
    ( 0.0   0.0   0.0 )   // 0: origin
    ( 3.0   0.0   0.0 )   // 1: channel width
    ( 3.0  40.0   0.0 )   // 2
    ( 0.0  40.0   0.0 )   // 3
    ( 0.0   0.0  40.0 )   // 4: flow length
    ( 3.0   0.0  40.0 )   // 5
    ( 3.0  40.0  40.0 )   // 6
    ( 0.0  40.0  40.0 )   // 7

    // Left fin wall (solid region)
    (-1.0   0.0   0.0 )   // 8
    ( 0.0   0.0   0.0 )   // 9 = vertex 0
    ( 0.0  40.0   0.0 )   // 10 = vertex 3
    (-1.0  40.0   0.0 )   // 11
    (-1.0   0.0  40.0 )   // 12
    ( 0.0   0.0  40.0 )   // 13 = vertex 4
    ( 0.0  40.0  40.0 )   // 14 = vertex 7
    (-1.0  40.0  40.0 )   // 15

    // Right fin wall (solid region)
    ( 3.0   0.0   0.0 )   // 16 = vertex 1
    ( 4.0   0.0   0.0 )   // 17
    ( 4.0  40.0   0.0 )   // 18
    ( 3.0  40.0   0.0 )   // 19 = vertex 2
    ( 3.0   0.0  40.0 )   // 20 = vertex 5
    ( 4.0   0.0  40.0 )   // 21
    ( 4.0  40.0  40.0 )   // 22
    ( 3.0  40.0  40.0 )   // 23 = vertex 6
);

blocks
(
    // Fluid channel: 3mm x 40mm x 40mm
    //   X: 10 cells across 3mm channel
    //   Y: 40 cells across 40mm height
    //   Z: 40 cells along 40mm flow length
    hex (0 1 2 3 4 5 6 7)  fluid (10 40 40) simpleGrading (1 1 1)

    // Left fin: 1mm x 40mm x 40mm
    hex (8 9 10 11 12 13 14 15)  solid (4 40 40) simpleGrading (1 1 1)

    // Right fin: 1mm x 40mm x 40mm
    hex (16 17 18 19 20 21 22 23) solid (4 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)     // fluid inlet
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)     // fluid outlet
        );
    }

    tegFace
    {
        // TEG contact surface (bottom of channel + fin bases)
        // In the real geometry this is the flat machined surface
        type wall;
        faces
        (
            (0 1 5 4)     // fluid bottom
            (8 9 13 12)   // left fin bottom
            (16 17 21 20) // right fin bottom
        );
    }

    topWall
    {
        // Opposite face from TEG (adiabatic or symmetry)
        type wall;
        faces
        (
            (3 2 6 7)     // fluid top
            (11 10 14 15) // left fin top
            (18 19 23 22) // right fin top
        );
    }

    fluid_to_leftFin
    {
        type wall;
        faces
        (
            (0 3 7 4)     // fluid left face
        );
    }

    fluid_to_rightFin
    {
        type wall;
        faces
        (
            (1 2 6 5)     // fluid right face
        );
    }

    leftFin_to_fluid
    {
        type wall;
        faces
        (
            (9 10 14 13)  // left fin right face (touches fluid)
        );
    }

    rightFin_to_fluid
    {
        type wall;
        faces
        (
            (16 19 23 20) // right fin left face (touches fluid)
        );
    }

    leftFinOuter
    {
        // Outer face of left fin (symmetry: adjacent channel)
        type symmetry;
        faces
        (
            (8 11 15 12)
        );
    }

    rightFinOuter
    {
        // Outer face of right fin (symmetry: adjacent channel)
        type symmetry;
        faces
        (
            (17 18 22 21)
        );
    }

    solidInlet
    {
        type wall;
        faces
        (
            (8 9 10 11)
            (16 17 18 19)
        );
    }

    solidOutlet
    {
        type wall;
        faces
        (
            (12 13 14 15)
            (20 21 22 23)
        );
    }
);

// ************************************************************************* //
