modeling/openfoam/hx_cell/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2.0;           // 2 seconds -- sufficient for steady-state

deltaT          0.001;         // 1 ms timestep

writeControl    adjustableRunTime;
writeInterval   0.1;

purgeWrite      5;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    tegFaceTemp
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        operation       areaAverage;
        regionType      patch;
        name            tegFace;
        fields          (T);
    }

    inletOutlet
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        operation       areaAverage;
        regionType      patch;
        name            inlet;
        fields          (T U p);
    }
}

// ************************************************************************* //
